easy = Easy
normal = Normal
hard = Hard
vip = Vip
case = Case
focus = Focus
solver = Solver
random_game = Random Game
develop = Develop
unstoppable = Unstoppable Hint
test_game = Test Game
copy_2_clipboard = Copy To Clipboard
delete = Delete
note_off = Note Off
note_on = Note ON
hint = Hint
strategy_name = strategy name
apply = Apply
no_strategy_available = no strategy available
search_finished = search finished
last_free_cell=last free cell
last_possible_number=last possible number
hidden_singles=hidden singles
obvious_pairs=obvious pairs
obvious_triples=obvious triples
hidden_pairs=hidden pairs
hidden_triples=hidden triples
pointing_pairs=pointing pairs
x_wing=x wing
y_wing=xy wing
swordfish=swordfish
hidden_three=hidden three
last_free_cell_desc=\u4e00\u4e2a\u5bab\u3001\u4e00\u884c\u6216\u4e00\u5217\u4e2d\u53ea\u5269\u4e0b\u4e00\u4e2a\u53ef\u7528\u5355\u5143\u683c\uff0c\u90a3\u4e48\u6211\u4eec\u5fc5\u987b\u660e\u786e\u7f3a\u5c11 1 \u5230 9 \u4e2d\u7684\u54ea\u4e2a\u6570\u5b57\uff0c\u5e76\u5c06\u5b83\u586b\u5165\u8fd9\u4e2a\u7a7a\u767d\u5355\u5143\u683c
last_possible_number_desc=\u627e\u5230\u7f3a\u5c11\u7684\u6570\u5b57\uff0c\u60a8\u5e94\u8be5\u770b\u770b\u611f\u5174\u8da3\u7684 3\u00d73 \u5bab\uff0c\u4ee5\u53ca\u4e0e\u4e4b\u76f8\u8fde\u7684\u884c\u548c\u5217\u4e2d\u5df2\u7ecf\u6709\u54ea\u4e9b\u6570\u5b57
hidden_singles_desc=\u9690\u6027\u5355\u4e00\u6570\u7684\u5173\u952e\u5728\u4e8e\u5728\u6574\u884c\u3001\u6574\u5217\u6216 3x3 \u5bab\u4e2d\u5bf9\u4e8e\u7279\u5b9a\u7684\u67d0\u4e2a\u6570\u5b57\u53ea\u6709\u4e00\u4e2a\u53ef\u884c\u7684\u4f4d\u7f6e
obvious_pairs_desc=\u9700\u8981\u627e\u5230 3x3 \u5bab\u4e2d\u7684 2 \u4e2a\u5177\u6709\u76f8\u540c\u7b14\u8bb0\u6570\u5bf9\u7684\u5355\u5143\u683c\u3002\u8fd9\u8bf4\u660e\u8fd9\u4e9b\u7b14\u8bb0\u6570\u5bf9\u4e0d\u80fd\u7528\u4e8e\u6b64 3x3 \u5bab\u7684\u5176\u4ed6\u5355\u5143\u683c\u4e2d\u3002\u56e0\u6b64\uff0c\u60a8\u53ef\u4ee5\u5c06\u5b83\u4eec\u4ece\u7b14\u8bb0\u4e2d\u5220\u9664
obvious_triples_desc=\u8fd9\u79cd\u6570\u72ec\u89e3\u6cd5\u5efa\u7acb\u5728\u4e4b\u524d\u7684\u201c\u663e\u6027\u6570\u5bf9\u201d\u57fa\u7840\u4e4b\u4e0a\u3002\u4f46\u201c\u663e\u6027\u4e09\u6570\u7ec4\u201d\u4e0d\u662f\u57fa\u4e8e\u7b14\u8bb0\u4e2d\u7684\u4e24\u4e2a\u6570\u5b57\uff0c\u800c\u662f\u57fa\u4e8e\u4e09\u4e2a\u6570\u5b57\u3002\u8fd9\u662f\u552f\u4e00\u7684\u533a\u522b\u3002
hidden_pairs_desc=\u5982\u679c\u60a8\u53d1\u73b0\u5728\u4e00\u884c\u3001\u4e00\u5217\u6216\u4e00\u4e2a 3x3 \u5bab\u7684\u4e24\u4e2a\u5355\u5143\u683c\u4e2d\u5305\u542b\u4e24\u6761\u672a\u51fa\u73b0\u5728\u5176\u4ed6\u5730\u65b9\u7684\u7b14\u8bb0\uff0c\u90a3\u4e48\u8fd9\u4e24\u6761\u7b14\u8bb0\u5fc5\u987b\u653e\u5728\u8fd9\u4e24\u4e2a\u5355\u5143\u683c\u4e2d\u3002\u6240\u6709\u5176\u4ed6\u7b14\u8bb0\u90fd\u53ef\u4ee5\u4ece\u8fd9\u4e24\u4e2a\u5355\u5143\u683c\u4e2d\u5220\u9664\u3002
hidden_triples_desc=\u5f53\u4e00\u884c\u3001\u4e00\u5217\u6216\u4e00\u4e2a 3x3 \u5bab\u4e2d\u7684\u4e09\u4e2a\u5355\u5143\u683c\u5305\u542b\u4e09\u6761\u76f8\u540c\u7684\u7b14\u8bb0\u65f6\uff0c\u201c\u9690\u6027\u4e09\u6570\u7ec4\u201d\u9002\u7528\u3002\u8fd9\u4e09\u4e2a\u5355\u5143\u683c\u8fd8\u5305\u542b\u5176\u4ed6\u5019\u9009\u6570\uff0c\u53ef\u4ee5\u5c06\u5b83\u4eec\u5220\u9664\u3002
pointing_pairs_desc=\u5f53\u4e00\u6761\u7b14\u8bb0\u5728\u4e00\u4e2a\u5bab\u4e2d\u51fa\u73b0\u4e24\u6b21\u6216\u8005\u4e09\u6b21\u5e76\u4e14\u8be5\u7b14\u8bb0\u5c5e\u4e8e\u540c\u4e00\u884c\u6216\u5217\u65f6\uff0c\u201c\u5bab\u533a\u5757\u6570\u5bf9\u201d\u9002\u7528\u3002\u8fd9\u8bf4\u660e\u8be5\u7b14\u8bb0\u5fc5\u7136\u662f\u8fd9\u4e2a\u5bab\u4e2d\u8fd9\u4e24\u4e2a\u6216\u8005\u4e09\u4e2a\u5355\u5143\u683c\u4e4b\u4e00\u7684\u89e3\u3002\u56e0\u6b64\uff0c\u60a8\u53ef\u4ee5\u5c06\u8be5\u7b14\u8bb0\u4ece\u8fd9\u4e00\u884c\u6216\u5217\u7684\u4efb\u4f55\u5176\u4ed6\u5355\u5143\u683c\u4e2d\u5220\u9664\u3002
x_wing_desc=\u5b83\u662f\u57fa\u4e8e\u4e24\u4e2a\u5e73\u884c\u7684\u884c\u6216\u5217\u3002\u60a8\u65e0\u9700\u5173\u6ce8 3x3 \u5bab
y_wing_desc=\u8fd9\u4e9b\u5355\u5143\u683c\uff08\u53eb\u505a\u201c\u94b3\u201d\uff09\u5e94\u8be5\u548c\u201c\u6298\u70b9\u201d\u4f4d\u4e8e\u540c\u4e00\u884c\u3001\u540c\u4e00\u5217\u6216\u540c\u4e00\u5bab\u4e2d\u3002\u6bcf\u4e2a\u201c\u94b3\u201d\u4e2d\u7684\u4e24\u4e2a\u6570\u5b57\u4e4b\u4e00\u5e94\u8be5\u4e0e\u201c\u6298\u70b9\u201d\u4e2d\u7684\u76f8\u540c\u3002\u4e24\u4e2a\u201c\u94b3\u201d\u4e2d\u7684\u53e6\u4e00\u4e2a\u6570\u5b57\u76f8\u540c"
swordfish_desc=6 \u662f\u6211\u4eec\u7684\u201c\u9c7c\u6570\u5b57\u201d\uff0c\u7b2c 1\u30016 \u548c 9 \u884c\u662f\u5b9a\u4e49\u57df\u3002\u6570\u5b57 6 \u7684\u5019\u9009\u5355\u5143\u683c\u4e5f\u5728 3 \u5217\u4e2d\u5b8c\u7f8e\u5bf9\u9f50\u3002\u56e0\u6b64\uff0c\u6570\u5b57 6 \u7684\u4f4d\u7f6e\u6709\u4e24\u79cd\u9009\u62e9\u3002
hidden_three_desc=\u5728\u4e00\u884c\u3001\u4e00\u5217\u3001\u4e00\u5bab\u4e2d\u6709\u4e09\u4e2a\u5355\u5143\u683c\u5019\u9009\u7684\u7684\u6570\u5b57\u90fd\u4e3a3\u4e2a\u4e14\u5b8c\u5168\u76f8\u540c\uff0c\u90a3\u4e48\u53ef\u4ee5\u6392\u9664\u5176\u5b83\u5355\u5143\u683c\u5305\u542b\u8fd9\u4e2a\u4e09\u4e2a\u6570\u5b57